mod lexer;
mod ast;
mod parser;
mod analyzer;
mod codegen;

use lexer::Lexer;
use parser::Parser;

fn main() {
    println!(r#"
  ██╗  ██╗██╗   ██╗████████╗███████╗
  ██║ ██╔╝╚██╗ ██╔╝╚══██╔══╝██╔════╝
  █████╔╝  ╚████╔╝    ██║   █████╗  
  ██╔═██╗   ╚██╔╝     ██║   ██╔══╝  
  ██║  ██╗   ██║      ██║   ███████╗
  ╚═╝  ╚═╝   ╚═╝      ╚═╝   ╚══════╝
  
  Kyte Compiler v0.1.0
  [ LLVM V21 ]
  "#);
  

    let source = r#"
@main(main)
int x = 10;
Kill "테스트";
"#;

    let mut lex = Lexer::new(source);
    let tokens  = lex.tokenize();
    let mut par = Parser::new(tokens);
    let ast     = par.parse();
    println!("{:#?}", ast);
}